Repository: chocoford/ExcalidrawZ
Catalog: ExcalidrawZ/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, nl, pl, pt, ru, th, tr, vi, zh_hans, zh_hant

# settingsAIMCPClaudeDesktopGuideSteps
source: In Claude Desktop, open Settings > Developer > Edit Config. Paste the mcpServers configuration below into claude_desktop_config.json, save the file, then restart Claude Desktop. This requires Node.js/npx.
ar: في Claude Desktop، افتح الإعدادات > المطور > تعديل التكوين. الصق تكوين المcpServers أدناه في claude_desktop_config.json، واحفظ الملف، ثم أعد تشغيل Claude Desktop. هذا يتطلب Node.js/npx.
de: Öffnen Sie in Claude Desktop die Einstellungen > Entwickler > Konfiguration bearbeiten. Fügen Sie die mcpServers-Konfiguration unten in die claude_desktop_config.json ein, speichern Sie die Datei und starten Sie Claude Desktop neu. Dies erfordert Node.js/npx.
es: En Claude Desktop, abre Configuración > Desarrollador > Editar Config. Pega la configuración de mcpServers a continuación en claude_desktop_config.json, guarda el archivo y luego reinicia Claude Desktop. Esto requiere Node.js/npx.
fr: Dans Claude Desktop, ouvrez Paramètres > Développeur > Modifier la configuration. Collez la configuration mcpServers ci-dessous dans claude_desktop_config.json, enregistrez le fichier, puis redémarrez Claude Desktop. Cela nécessite Node.js/npx.
hi: क्लॉड डेस्कटॉप में, सेटिंग्स > डेवलपर > कॉन्फ़िग संपादित करें खोलें। नीचे दिए गए mcpServers कॉन्फ़िगरेशन को claude_desktop_config.json में पेस्ट करें, फ़ाइल सहेजें, फिर क्लॉड डेस्कटॉप को फिर से चालू करें। इसके लिए Node.js/npx की आवश्यकता है।
it: In Claude Desktop, apri Impostazioni > Sviluppatore > Modifica Config. Incolla la configurazione mcpServers qui sotto in claude_desktop_config.json, salva il file e poi riavvia Claude Desktop. Questo richiede Node.js/npx.
ja: Claudeデスクトップで、設定 > 開発者 > 設定の編集を開きます。以下のmcpServers設定をclaude_desktop_config.jsonに貼り付けて、ファイルを保存し、その後Claudeデスクトップを再起動してください。これはNode.js/npxを必要とします。
ko: 클로드 데스크톱에서 설정 > 개발자 > 구성 편집을 엽니다. 아래의 mcpServers 구성을 claude_desktop_config.json에 붙여넣고 파일을 저장한 후 클로드 데스크톱을 재시작하십시오. Node.js/npx가 필요합니다.
nl: Open in Claude Desktop Instellingen > Ontwikkelaar > Configuratie bewerken. Plak de mcpServers-configuratie hieronder in claude_desktop_config.json, sla het bestand op en herstart Claude Desktop. Dit vereist Node.js/npx.
pl: W Claude Desktop otwórz Ustawienia > Deweloper > Edytuj konfigurację. Wklej konfigurację mcpServers poniżej do claude_desktop_config.json, zapisz plik, a następnie zrestartuj Claude Desktop. To wymaga Node.js/npx.
pt: No Claude Desktop, abra Configurações > Desenvolvedor > Editar Config. Cole a configuração mcpServers abaixo no claude_desktop_config.json, salve o arquivo e reinicie o Claude Desktop. Isso requer Node.js/npx.
ru: В Claude Desktop откройте Настройки > Разработчик > Редактировать конфигурацию. Вставьте конфигурацию mcpServers ниже в файл claude_desktop_config.json, сохраните файл, затем перезапустите Claude Desktop. Для этого требуется Node.js/npx.
th: ใน Claude Desktop ให้เปิด การตั้งค่า > นักพัฒนา > แก้ไขการตั้งค่า วางการตั้งค่าต่อไปนี้ลงใน claude_desktop_config.json บันทึกไฟล์ จากนั้นรีสตาร์ท Claude Desktop ทั้งนี้จำเป็นต้องใช้ Node.js/npx
tr: Claude Masaüstü'nde Ayarlar > Geliştirici > Yapılandırmayı Düzenle bölümünü açın. Aşağıdaki mcpServers yapılandırmasını claude_desktop_config.json dosyasına yapıştırın, dosyayı kaydedin ve ardından Claude Masaüstü'nü yeniden başlatın. Bu, Node.js/npx gerektirir.
vi: Trong Claude Desktop, mở Cài đặt > Nhà phát triển > Chỉnh sửa cấu hình. Dán cấu hình mcpServers bên dưới vào file claude_desktop_config.json, lưu tệp, sau đó khởi động lại Claude Desktop. Điều này yêu cầu Node.js/npx.
zh_hans: 在 Claude Desktop 中，打开设置 > 开发者 > 编辑配置。将下面的 mcpServers 配置粘贴到 claude_desktop_config.json，保存文件，然后重启 Claude Desktop。此方式需要 Node.js/npx。
zh_hant: 在 Claude Desktop 中，打開設置 > 開發者 > 編輯配置。將下面的 mcpServers 配置貼到 claude_desktop_config.json，保存文件，然後重新啟動 Claude Desktop。此方式需要 Node.js/npx。

# settingsAIMCPClaudeDesktopOpenConfigButton
source: Open Config
ar: فتح التكوين
de: Konfiguration öffnen
es: Abrir configuración
fr: Ouvrir la configuration
hi: कॉन्फ़िग खोलें
it: Apri Config
ja: 設定を開く
ko: 구성 열기
nl: Open Configuratie
pl: Otwórz konfigurację
pt: Abrir Configuração
ru: Открыть конфигурацию
th: เปิดการตั้งค่า
tr: Yapılandırmayı Aç
vi: Mở cấu hình
zh_hans: 打开配置
zh_hant: 打開配置

# settingsAIMCPClaudeDesktopRevealFolderButton
source: Reveal Folder
ar: إظهار المجلد
de: Ordner anzeigen
es: Revelar carpeta
fr: Révéler le dossier
hi: फ़ोल्डर दिखाएँ
it: Mostra Cartella
ja: フォルダーを表示
ko: 폴더 표시
nl: Toon Map
pl: Odsłoń folder
pt: Revelar Pasta
ru: Показать папку
th: เปิดเผยโฟลเดอร์
tr: Klasörü Göster
vi: Hiện thư mục
zh_hans: 显示文件夹
zh_hant: 顯示資料夾

# settingsAIMCPClaudeUnsupportedHelp
source: Use VS Code or another local MCP client for now. Remote HTTPS support can be added later.
ar: استخدم VS Code أو عميل MCP محلي آخر في الوقت الحالي. يمكن إضافة دعم HTTPS عن بُعد لاحقًا.
de: Verwenden Sie vorerst VS Code oder einen anderen lokalen MCP-Client. Die Unterstützung für Remote-HTTPS kann später hinzugefügt werden.
es: Usa VS Code u otro cliente MCP local por ahora. El soporte para HTTPS remoto puede ser añadido más tarde.
fr: Utilisez VS Code ou un autre client MCP local pour le moment. Le support HTTPS distant peut être ajouté plus tard.
hi: अभी के लिए VS कोड या किसी अन्य स्थानीय MCP क्लाइंट का उपयोग करें। दूरस्थ HTTPS समर्थन बाद में जोड़ा जा सकता है।
it: Utilizza VS Code o un altro client MCP locale per ora. Il supporto per HTTPS remoto può essere aggiunto in seguito.
ja: 今のところVS Codeまたは他のローカルMCPクライアントを使用してください。リモートHTTPSサポートは後で追加できます。
ko: 지금은 VS 코드를 사용하거나 다른 로컬 MCP 클라이언트를 사용하세요. 원격 HTTPS 지원은 나중에 추가될 수 있습니다.
nl: Gebruik voorlopig VS Code of een andere lokale MCP-client. Ondersteuning voor externe HTTPS kan later worden toegevoegd.
pl: Na razie użyj VS Code lub innego lokalnego klienta MCP. Obsługa zdalnego HTTPS może być dodana później.
pt: Use o VS Code ou outro cliente MCP local por enquanto. O suporte a HTTPS remoto pode ser adicionado depois.
ru: Используйте VS Code или другой локальный клиент MCP на данный момент. Поддержка удаленного HTTPS может быть добавлена позже.
th: ใช้ VS Code หรือคลินต์ MCP ท้องถิ่นอื่นในขณะนี้ การสนับสนุน HTTPS ระยะไกลสามารถเพิ่มเติมในภายหลัง
tr: Şimdilik VS Code veya başka bir yerel MCP istemcisi kullanın. Uzaktan HTTPS desteği daha sonra eklenebilir.
vi: Hiện tại, hãy sử dụng VS Code hoặc một khách hàng MCP cục bộ khác. Hỗ trợ HTTPS từ xa có thể được thêm sau.
zh_hans: 暂时使用 VS Code 或其他本地 MCP 客户端。远程 HTTPS 支持可以稍后添加。
zh_hant: 目前請使用 VS Code 或其他本地 MCP 客戶端。遠程 HTTPS 支持可以稍後添加。

# settingsAIMCPClaudeUnsupportedMessage
source: Claude Desktop custom connectors currently accept remote HTTPS URLs only. ExcalidrawZ runs a local HTTP MCP server, so it cannot be connected from that connector screen yet.
ar: موصلات عميل Claude Desktop تقبل حاليًا عناوين URL عن بُعد HTTPS فقط. يقوم ExcalidrawZ بتشغيل خادم HTTP MCP محلي، لذا لا يمكن الاتصال من تلك الشاشة حتى الآن.
de: Die benutzerdefinierten Connectoren von Claude Desktop akzeptieren derzeit nur Remote-HTTPS-URLs. ExcalidrawZ führt einen lokalen HTTP-MCP-Server aus, sodass dieser derzeit nicht von diesem Connector-Bildschirm aus verbunden werden kann.
es: Los conectores personalizados de Claude Desktop actualmente aceptan solo URLs HTTPS remotas. ExcalidrawZ ejecuta un servidor HTTP MCP local, por lo que no se puede conectar desde esa pantalla de conectores aún.
fr: Les connecteurs personnalisés de Claude Desktop acceptent actuellement uniquement les URL HTTPS distantes. ExcalidrawZ exécute un serveur HTTP MCP local, donc il ne peut pas être connecté depuis cet écran de connecteur pour l'instant.
hi: Claude डेस्कटॉप कस्टम कनेक्टर वर्तमान में केवल दूरस्थ HTTPS URLs स्वीकार करते हैं। ExcalidrawZ एक स्थानीय HTTP MCP सर्वर चलाता है, इसलिए इसे उस कनेक्टर स्क्रीन से अभी कनेक्ट नहीं किया जा सकता।
it: I connettori personalizzati di Claude Desktop attualmente accettano solo URL HTTPS remoti. ExcalidrawZ esegue un server HTTP MCP locale, quindi non può essere collegato da quella schermata del connettore per il momento.
ja: Claude Desktopのカスタムコネクタは現在、リモートHTTPS URLのみを受け付けます。ExcalidrawZはローカルHTTP MCPサーバーを実行しているため、そのコネクタ画面からは接続できません。
ko: Claude Desktop의 사용자 지정 커넥터는 현재 원격 HTTPS URL만 수락합니다. ExcalidrawZ는 로컬 HTTP MCP 서버를 실행하므로 해당 커넥터 화면에서 연결할 수 없습니다.
nl: Claude Desktop aangepaste connectors accepteren momenteel alleen externe HTTPS-URL's. ExcalidrawZ draait een lokale HTTP MCP-server, dus het kan nog niet vanuit dat connector-scherm worden verbonden.
pl: Kustomowe konektory Claude Desktop obecnie akceptują tylko zdalne adresy URL HTTPS. ExcalidrawZ działa jako lokalny serwer HTTP MCP, więc nie można się podłączyć z tego ekranu konektora na razie.
pt: Conectores personalizados do Claude Desktop atualmente aceitam apenas URLs HTTPS remotas. O ExcalidrawZ executa um servidor HTTP MCP local, portanto, não pode ser conectado a partir dessa tela de conectores ainda.
ru: Пользовательские соединители Claude Desktop в настоящее время принимают только удаленные HTTPS URL. ExcalidrawZ запускает локальный HTTP MCP сервер, поэтому пока нельзя подключиться с этого экрана соединителей.
th: ตัวเชื่อมที่กำหนดเองของ Claude Desktop ขณะนี้รับเฉพาะ URL HTTPS ระยะไกล ExcalidrawZ รันเซิร์ฟเวอร์ HTTP MCP ท้องถิ่น ดังนั้นจึงไม่สามารถเชื่อมต่อจากหน้าจอนั้นได้ในขณะนี้
tr: Claude Desktop özel bağlayıcıları şu anda yalnızca uzaktan HTTPS URL'lerini kabul ediyor. ExcalidrawZ yerel bir HTTP MCP sunucusu çalıştırıyor, bu nedenle o bağlayıcı ekranından henüz bağlanamaz.
vi: Các kết nối tùy chỉnh trên Claude Desktop hiện chỉ chấp nhận các URL HTTPS từ xa. ExcalidrawZ chạy một máy chủ HTTP MCP cục bộ, vì vậy không thể kết nối từ màn hình kết nối đó vào lúc này.
zh_hans: Claude Desktop 自定义连接器目前仅接受远程 HTTPS URL。ExcalidrawZ 运行一个本地 HTTP MCP 服务器，因此无法从该连接器界面连接。
zh_hant: Claude Desktop 自定義連接器目前僅接受遠程 HTTPS URL。ExcalidrawZ 運行一個本地 HTTP MCP 伺服器，因此目前無法從該連接器畫面連接。

# settingsAIMCPClaudeUnsupportedTitle
source: Claude Desktop is not supported yet
ar: عميل Claude Desktop غير مدعوم بعد
de: Claude Desktop wird noch nicht unterstützt
es: Claude Desktop no está soportado aún
fr: Claude Desktop n'est pas encore pris en charge
hi: Claude डेस्कटॉप अभी समर्थित नहीं है
it: Claude Desktop non è ancora supportato
ja: Claude Desktopはまだサポートされていません
ko: Claude Desktop은 아직 지원되지 않습니다
nl: Claude Desktop wordt nog niet ondersteund
pl: Claude Desktop nie jest jeszcze obsługiwany
pt: Claude Desktop ainda não é suportado
ru: Claude Desktop пока не поддерживается
th: Claude Desktop ยังไม่ได้รับการสนับสนุน
tr: Claude Desktop henüz desteklenmiyor
vi: Claude Desktop chưa được hỗ trợ
zh_hans: Claude Desktop 尚不支持
zh_hant: Claude Desktop 尚不支持

# settingsAIMCPConnectHelp
source: Connect compatible MCP clients using ExcalidrawZ's local HTTP server.
ar: اتصل بعملاء MCP المتوافقين باستخدام خادم HTTP المحلي لExcalidrawZ.
de: Verbinden Sie kompatible MCP-Clients über den lokalen HTTP-Server von ExcalidrawZ.
es: Conecta clientes MCP compatibles usando el servidor HTTP local de ExcalidrawZ.
fr: Connectez des clients MCP compatibles en utilisant le serveur HTTP local d'ExcalidrawZ.
hi: ExcalidrawZ के स्थानीय HTTP सर्वर का उपयोग करके संगत MCP क्लाइंट को कनेक्ट करें।
it: Collega i client MCP compatibili utilizzando il server HTTP locale di ExcalidrawZ.
ja: ExcalidrawZのローカルHTTPサーバーを使用して、互換性のあるMCPクライアントを接続します。
ko: ExcalidrawZ의 로컬 HTTP 서버를 사용하여 호환 가능한 MCP 클라이언트를 연결하세요.
nl: Verbind compatibele MCP-clients met de lokale HTTP-server van ExcalidrawZ.
pl: Połącz zgodne klienty MCP korzystając z lokalnego serwera HTTP ExcalidrawZ.
pt: Conecte clientes MCP compatíveis usando o servidor HTTP local do ExcalidrawZ.
ru: Подключите совместимые клиенты MCP, используя локальный HTTP-сервер ExcalidrawZ.
th: เชื่อมต่อคลินต์ MCP ที่เข้ากันได้โดยใช้เซิร์ฟเวอร์ HTTP ท้องถิ่นของ ExcalidrawZ
tr: ExcalidrawZ'nin yerel HTTP sunucusunu kullanarak uyumlu MCP istemcilerini bağlayın.
vi: Kết nối các khách hàng MCP tương thích bằng máy chủ HTTP cục bộ của ExcalidrawZ.
zh_hans: 使用 ExcalidrawZ 的本地 HTTP 服务器连接兼容的 MCP 客户端。
zh_hant: 使用 ExcalidrawZ 的本地 HTTP 伺服器連接兼容的 MCP 客戶端。

# settingsAIMCPConnectionGuideCodexTabTitle
source: Codex
ar: كودكس
hi: कोडेक्स
ja: コーデックス
ko: 코덱스
ru: Кодекс

# settingsAIMCPCodexGuideMessage
source: Codex connects directly to ExcalidrawZ's local streamable HTTP MCP endpoint. Keep ExcalidrawZ open and enable the MCP Server first.
ar: يتصل كودكس مباشرةً بنقطة نهاية MCP القابلة للبث على HTTP المحلية لـ ExcalidrawZ. حافظ على فتح ExcalidrawZ وقم بتمكين خادم MCP أولاً.
de: Codex verbindet sich direkt mit dem lokalen streambaren HTTP MCP-Endpunkt von ExcalidrawZ. Halten Sie ExcalidrawZ geöffnet und aktivieren Sie zuerst den MCP-Server.
es: Codex se conecta directamente al endpoint HTTP MCP local transmisible de ExcalidrawZ. Mantén ExcalidrawZ abierto y habilita primero el servidor MCP.
fr: Codex se connecte directement à l'endpoint HTTP MCP local d'ExcalidrawZ. Gardez ExcalidrawZ ouvert et activez d'abord le serveur MCP.
hi: कोडेक्स सीधे ExcalidrawZ के स्थानीय स्ट्रीम करने योग्य HTTP MCP एंडपॉइंट से कनेक्ट करता है। पहले ExcalidrawZ को खुला रखें और MCP सर्वर सक्षम करें।
it: Codex si connette direttamente all'endpoint HTTP MCP locale di ExcalidrawZ. Mantieni ExcalidrawZ aperto e attiva prima il server MCP.
ja: コーデックスは、ExcalidrawZのローカルストリーミングHTTP MCPエンドポイントに直接接続します。まずExcalidrawZを開き、MCPサーバーを有効にしてください。
ko: 코덱스는 ExcalidrawZ의 로컬 스트리밍 가능한 HTTP MCP 엔드포인트에 직접 연결됩니다. 먼저 ExcalidrawZ를 열고 MCP 서버를 활성화하세요.
nl: Codex maakt rechtstreeks verbinding met ExcalidrawZ's lokale streambare HTTP MCP eindpunt. Houd ExcalidrawZ open en schakel de MCP Server eerst in.
pl: Codex łączy się bezpośrednio z lokalnym punktem końcowym HTTP MCP ExcalidrawZ. Najpierw otwórz ExcalidrawZ i włącz serwer MCP.
pt: O Codex conecta-se diretamente ao endpoint HTTP MCP local gravável do ExcalidrawZ. Mantenha o ExcalidrawZ aberto e habilite o Servidor MCP primeiro.
ru: Кодекс напрямую подключается к локальной потоковой HTTP MCP конечной точке ExcalidrawZ. Сначала откройте ExcalidrawZ и включите сервер MCP.
th: Codex เชื่อมต่อโดยตรงกับจุดสุดยอด HTTP MCP ที่สามารถสตรีมได้ของ ExcalidrawZ โปรดเปิด ExcalidrawZ และเปิดใช้งาน MCP Server ก่อน
tr: Codex, ExcalidrawZ'nin yerel akışa uygun HTTP MCP uç noktasına doğrudan bağlanır. Önce ExcalidrawZ'yi açık tutun ve MCP Sunucusunu etkinleştirin.
vi: Codex kết nối trực tiếp với đầu cuối HTTP MCP có thể phát trực tuyến của ExcalidrawZ. Giữ ExcalidrawZ mở và bật Máy Chủ MCP trước.
zh_hans: Codex 可以直接连接 ExcalidrawZ 的本地 streamable HTTP MCP 端点。请先保持 ExcalidrawZ 打开并启用 MCP 服务器。
zh_hant: Codex 可以直接連接 ExcalidrawZ 的本地 streamable HTTP MCP 端點。請先保持 ExcalidrawZ 開啟並啟用 MCP 伺服器。

# settingsAIMCPCodexGuideSteps
source: In Codex, open Settings > MCP Servers > Add server. Choose Streamable HTTP server, enter the server name and URL below, then save.
ar: في كودكس، افتح الإعدادات > خوادم MCP > إضافة خادم. اختر خادم HTTP القابل للبث، أدخل اسم الخادم وURL أدناه، ثم احفظ.
de: Öffnen Sie in Codex Einstellungen > MCP-Server > Server hinzufügen. Wählen Sie den streambaren HTTP-Server, geben Sie den Servernamen und die URL unten ein und speichern Sie dann.
es: En Codex, abre Configuración > Servidores MCP > Agregar servidor. Elige servidor HTTP transmisible, ingresa el nombre y la URL del servidor a continuación, y luego guarda.
fr: Dans Codex, ouvrez Paramètres > Serveurs MCP > Ajouter un serveur. Choisissez le serveur HTTP streamable, saisissez le nom et l'URL du serveur ci-dessous, puis enregistrez.
hi: कोडेक्स में, सेटिंग्स > MCP सर्वर > सर्वर जोड़ें खोलें। स्ट्रीम करने योग्य HTTP सर्वर चुनें, सर्वर का नाम और URL नीचे दर्ज करें, फिर सहेजें।
it: In Codex, apri Impostazioni > Server MCP > Aggiungi server. Scegli server HTTP streamabile, inserisci il nome e l'URL del server qui sotto, quindi salva.
ja: コーデックスで、設定 > MCPサーバー > サーバーを追加を開きます。ストリーミングHTTPサーバーを選択し、サーバー名とURLを以下に入力してから、保存します。
ko: 코덱스에서 설정 > MCP 서버 > 서버 추가를 엽니다. 스트리밍 가능한 HTTP 서버를 선택하고, 아래에 서버 이름과 URL을 입력한 다음 저장하세요.
nl: Open in Codex Instellingen > MCP Servers > Server toevoegen. Kies Streambare HTTP server, voer de servernaam en URL hieronder in en sla op.
pl: W Codexie otwórz Ustawienia > Serwery MCP > Dodaj serwer. Wybierz serwer HTTP do przesyłania, wpisz nazwę serwera i URL poniżej, a następnie zapisz.
pt: No Codex, abra Configurações > Servidores MCP > Adicionar servidor. Escolha o servidor HTTP gravável, insira o nome do servidor e a URL abaixo e, em seguida, salve.
ru: В Кодексе откройте Настройки > MCP Серверы > Добавить сервер. Выберите потоковый HTTP сервер, введите имя и URL сервера ниже, затем сохраните.
th: ใน Codex ไปที่การตั้งค่า > MCP Servers > เพิ่มเซิร์ฟเวอร์ เลือกเซิร์ฟเวอร์ HTTP ที่สามารถสตรีมได้ ป้อนชื่อเซิร์ฟเวอร์และ URL ด้านล่างแล้วบันทึก
tr: Codex'te, Ayarlar > MCP Sunucuları > Sunucu ekle'yi açın. Akışa uygun HTTP sunucusunu seçin, sunucu adını ve URL'sini aşağıya girin, ardından kaydedin.
vi: Trong Codex, mở Cài đặt > Máy Chủ MCP > Thêm máy chủ. Chọn máy chủ HTTP có thể phát trực tuyến, nhập tên máy chủ và URL bên dưới, sau đó lưu.
zh_hans: 在 Codex 中，打开 Settings > MCP Servers > Add server。选择 Streamable HTTP server，输入下面的服务器名称和 URL，然后保存。
zh_hant: 在 Codex 中，打開 Settings > MCP Servers > Add server。選擇 Streamable HTTP server，輸入下面的伺服器名稱和 URL，然後保存。

# settingsAIMCPCodexServerNameLabel
source: Server name
ar: اسم الخادم
es: Nombre del servidor
fr: Nom du serveur
hi: सर्वर का नाम
it: Nome server
ja: サーバー名
ko: 서버 이름
nl: Servernaam
pl: Nazwa serwera
pt: Nome do servidor
ru: Имя сервера
th: ชื่อเซิร์ฟเวอร์
tr: Sunucu adı
vi: Tên máy chủ
zh_hans: 服务器名称
zh_hant: 伺服器名稱

# settingsAIMCPCodexServerURLLabel
source: Server URL
ar: عنوان URL للخادم
es: URL del servidor
fr: URL du serveur
hi: सर्वर URL
it: URL server
ja: サーバーURL
ko: 서버 URL
pl: URL serwera
pt: URL do servidor
ru: URL сервера
th: URL เซิร์ฟเวอร์
tr: Sunucu URL'si
vi: URL máy chủ
zh_hans: 服务器 URL
zh_hant: 伺服器 URL

# settingsAIMCPConnectionGuideMessage
source: Keep ExcalidrawZ open with the MCP server enabled, then copy this configuration into Claude or another MCP client that supports HTTP MCP servers.
ar: احتفظ بExcalidrawZ مفتوحًا مع خادم MCP ممكّن، ثم انسخ هذا تكوين في Claude أو أي عميل MCP آخر يدعم خوادم HTTP MCP.
de: Halten Sie ExcalidrawZ mit aktiviertem MCP-Server geöffnet und kopieren Sie diese Konfiguration in Claude oder einen anderen MCP-Client, der HTTP MCP-Server unterstützt.
es: Mantén ExcalidrawZ abierto con el servidor MCP habilitado, luego copia esta configuración en Claude u otro cliente MCP que soporte servidores HTTP MCP.
fr: Gardez ExcalidrawZ ouvert avec le serveur MCP activé, puis copiez cette configuration dans Claude ou un autre client MCP qui prend en charge les serveurs HTTP MCP.
hi: ExcalidrawZ को चालू रखें और MCP सर्वर को सक्षम रखें, फिर इस कॉन्फ़िगरेशन को Claude या किसी दूसरे MCP क्लाइंट में कॉपी करें जो HTTP MCP सर्वरों का समर्थन करता है।
it: Tieni aperto ExcalidrawZ con il server MCP attivato, quindi copia questa configurazione in Claude o in un altro client MCP che supporta i server HTTP MCP.
ja: MCPサーバーを有効にしてExcalidrawZを開いたままにし、この設定をClaudeやHTTP MCPサーバーをサポートする他のMCPクライアントにコピーします。
ko: MCP 서버가 활성화된 상태로 ExcalidrawZ를 열어두고, 이 구성을 Claude 또는 HTTP MCP 서버를 지원하는 다른 MCP 클라이언트에 복사하세요.
nl: Houd ExcalidrawZ geopend met de MCP-server ingeschakeld en kopieer deze configuratie naar Claude of een andere MCP-client die HTTP MCP-servers ondersteunt.
pl: Utrzymaj otwarte ExcalidrawZ z włączonym serwerem MCP, a następnie skopiuj tę konfigurację do Claude'a lub innego klienta MCP, który obsługuje serwery HTTP MCP.
pt: Mantenha o ExcalidrawZ aberto com o servidor MCP habilitado, e então copie esta configuração para o Claude ou outro cliente MCP que suporte servidores MCP HTTP.
ru: Держите ExcalidrawZ открытым с включенным сервером MCP, затем скопируйте эту конфигурацию в Claude или другой клиент MCP, который поддерживает HTTP-серверы MCP.
th: ให้เปิด ExcalidrawZ พร้อมเซิร์ฟเวอร์ MCP เปิดอยู่ จากนั้นคัดลอกการตั้งค่านี้ไปยัง Claude หรือคลินต์ MCP อื่นที่รองรับเซิร์ฟเวอร์ HTTP MCP
tr: ExcalidrawZ açık kalsın ve MCP sunucusu etkin olsun, ardından bu yapılandırmayı Claude veya HTTP MCP sunucularını destekleyen başka bir MCP istemcisine kopyalayın.
vi: Giữ cho ExcalidrawZ mở với máy chủ MCP được bật, sau đó sao chép cấu hình này vào Claude hoặc một khách hàng MCP khác hỗ trợ máy chủ HTTP MCP.
zh_hans: 保持 ExcalidrawZ 开放并启用 MCP 服务器，然后将此配置复制到 Claude 或其他支持 HTTP MCP 服务器的 MCP 客户端。
zh_hant: 保持 ExcalidrawZ 開啟並啟用 MCP 伺服器，然後將此配置複製到 Claude 或其他支持 HTTP MCP 伺服器的 MCP 客戶端中。

# settingsAIMCPConnectionGuideTitle
source: Connect MCP Client
ar: اتصل بعميل MCP
de: MCP-Client verbinden
es: Conectar Cliente MCP
fr: Connecter le client MCP
hi: MCP क्लाइंट कनेक्ट करें
it: Collega Client MCP
ja: MCPクライアントを接続
ko: MCP 클라이언트 연결
nl: Verbind MCP-client
pl: Połącz klienta MCP
pt: Conectar Cliente MCP
ru: Подключить клиент MCP
th: เชื่อมต่อคลินต์ MCP
tr: MCP İstemcisini Bağla
vi: Kết nối Khách hàng MCP
zh_hans: 连接 MCP 客户端
zh_hant: 連接 MCP 客戶端

# settingsAIMCPConnectLabel
source: Connect MCP Client
ar: اتصل بعميل MCP
de: MCP-Client verbinden
es: Conectar Cliente MCP
fr: Connecter le client MCP
hi: MCP क्लाइंट कनेक्ट करें
it: Collega Client MCP
ja: MCPクライアントを接続
ko: MCP 클라이언트 연결
nl: Verbind MCP-client
pl: Połącz klienta MCP
pt: Conectar Cliente MCP
ru: Подключить клиент MCP
th: เชื่อมต่อคลินต์ MCP
tr: MCP İstemcisini Bağla
vi: Kết nối Khách hàng MCP
zh_hans: 连接 MCP 客户端
zh_hant: 連接 MCP 客戶端

# settingsAIMCPHowToConnectButton
source: Connect
ar: اتصل
de: Verbinden
es: Conectar
fr: Connecter
hi: कनेक्ट
it: Collegati
ja: 接続
ko: 연결
nl: Verbinden
pl: Połącz
pt: Conectar
ru: Подключиться
th: เชื่อมต่อ
tr: Bağlan
vi: Kết nối
zh_hans: 连接
zh_hant: 連接

# settingsAIMCPHTTPConfigLabel
source: HTTP Configuration
ar: تكوين HTTP
de: HTTP-Konfiguration
es: Configuración HTTP
fr: Configuration HTTP
hi: HTTP कॉन्फ़िगरेशन
it: Configurazione HTTP
ja: HTTP設定
ko: HTTP 구성
nl: HTTP-configuratie
pl: Konfiguracja HTTP
pt: Configuração HTTP
ru: HTTP Конфигурация
th: การตั้งค่า HTTP
tr: HTTP Yapılandırması
vi: Cấu hình HTTP
zh_hans: HTTP 配置
zh_hant: HTTP 配置

# settingsAIMCPServerToggleHelp
source: Allow external AI apps to connect to ExcalidrawZ through MCP.
ar: اسمح لتطبيقات الذكاء الاصطناعي الخارجية بالاتصال بـ ExcalidrawZ من خلال MCP.
de: Erlauben Sie externen KI-Apps, sich über MCP mit ExcalidrawZ zu verbinden.
es: Permitir que aplicaciones de IA externas se conecten a ExcalidrawZ a través de MCP.
fr: Autoriser les applications AI externes à se connecter à ExcalidrawZ via MCP.
hi: बाहरी एआई ऐप्स को MCP के माध्यम से ExcalidrawZ से कनेक्ट करने की अनुमति दें।
it: Consenti alle app AI esterne di connettersi a ExcalidrawZ tramite MCP.
ja: 外部AIアプリがMCPを介してExcalidrawZに接続できるようにします。
ko: 외부 AI 앱이 MCP를 통해 ExcalidrawZ에 연결할 수 있도록 허용합니다.
nl: Sta externe AI-apps toe om verbinding te maken met ExcalidrawZ via MCP.
pl: Zezwól zewnętrznym aplikacjom AI na połączenie z ExcalidrawZ przez MCP.
pt: Permitir que aplicativos de IA externos se conectem ao ExcalidrawZ através do MCP.
ru: Разрешить внешним AI-приложениям подключаться к ExcalidrawZ через MCP.
th: อนุญาตให้แอป AI ภายนอกเชื่อมต่อกับ ExcalidrawZ ผ่าน MCP
tr: Dış AI uygulamalarının ExcalidrawZ'ye MCP aracılığıyla bağlanmasına izin verin.
vi: Cho phép các ứng dụng AI bên ngoài kết nối với ExcalidrawZ thông qua MCP.
zh_hans: 允许外部 AI 应用通过 MCP 连接到 ExcalidrawZ。
zh_hant: 允許外部 AI 應用通過 MCP 連接到 ExcalidrawZ。

# settingsAIMCPServerToggleTitle
source: MCP Server
ar: خادم MCP
es: Servidor MCP
fr: Serveur MCP
hi: MCP सर्वर
it: Server MCP
ja: MCPサーバー
ko: MCP 서버
pl: Serwer MCP
pt: Servidor MCP
ru: Сервер MCP
th: เซิร์ฟเวอร์ MCP
tr: MCP Sunucusu
vi: Máy chủ MCP
zh_hans: MCP 服务器
zh_hant: MCP 伺服器
